"""
1. რიცხვების გაორმაგება
   დაწერეთ lambda-ფუნქცია, რომელიც იღებს რიცხვს და აბრუნებს მის გაორმაგებულ მნიშვნელობას.  

2. სტრინგის სიგრძის გამოთვლა
   დაწერეთ lambda-ფუნქცია, რომელიც იღებს სტრინგს და აბრუნებს მის სიმბოლოების რაოდენობას.  

3. კენტ და ლუწი რიცხვების ამოცნობა
   დაწერეთ lambda-ფუნქცია, რომელიც ამოწმებს, რიცხვი კენტია თუ არა.  

4. რიცხვების კვადრატში აყვანა
   დაწერეთ lambda-ფუნქცია, რომელიც იღებს რიცხვს და აბრუნებს მის კვადრატს.  

5. ლუწი რიცხვების კვადრატში აყვანა სიიდან
   დაწერეთ ფუნქცია, რომელიც lambda-ფუნქციას გამოიყენებს, რათა სიიდან ლუწი რიცხვები ამოარჩიოს და თითოეული მათგანი კვადრატში აიყვანოს.
"""

#task-1
int= lambda y : y*2
print(int(5))

#task-2
string= lambda word: len(word)
print(string("hello world"))

#task-3
num=lambda u: "luwia" if u%2==0 else "kentia"
print(num(5))

#task-4
num=lambda x: x**2
print(num(5))

#task-5

list=[1,2,3,4,5,6,7,8,9,10]

def main(list):
    new_list=lambda list: new_list.append([ x for x in list if x%2==0])
    return new_list

print(main(list(list)))