# 1) მოცემულია სია: nums = [10, 20, 30], მომხმარებელს შეაყვანინე ინდექსი და დაბეჭდე შესაბამისი ელემენტი. თუ ინდექსი არ არის რიცხვი გამოიტანე ერორი, თუ ინდექსი სცდება სიის ზომას გამოიტანე ერორი, თუ ყველაფერი სწორია დაბეჭდე ელემენტი, ნებისმიერ შემთხვევაში დაბეჭდე "შემოწმება დასრულდა"

nums = [10, 20, 30]

try:
    user_inp= int(input("Enter a index: "))
    print(nums[user_inp])
except ValueError:
    print("erroe value type")

except IndexError:
    print("Erorr index type")

finally:
    print("შემოწმება დასრულდა")




# 2) მომხმარებელს შეაყვანინე ასაკი. თუ ასაკი არ არის რიცხვი გამოიტანე ერორი, თუ ასაკი უარყოფითია გამოიტანე შეცდომა (ValueError), თუ ყველაფერი სწორია დაბეჭდე "ასაკი მიღებულია".



# 3) მომხმარებელს შემოაყვანინე პაროლი, პაროლი უნდა შეიცავდეს მინიმუმ 8 სიმბოლოს, უნდა შეიცავდეს რიცხვს, არ უნდა შეიცავდეს space,წესის დარღვევა -> valueError, წარმატება -> "პაროლი მიღებულია", საბოლოოდ გამოიტანე "შემოწმება დასრულებულია"
# 4) მომხმარებელს შემოაყვანინე 5 მნიშვნელობა, რომელსაც დაამატებ სიაში. თუ შემოყვანილი მნიშვნელობა არ არის რიცხვი დაბეჭდე ერორი, თუ რიცხვი უარყოფითია -> valueError, თუ ყველაფერი კარგადაა გამოითვალე სიაში მყოფი რიცხვების საშუალო არითმეტიკული, საბოლოოდ დაბეჭდე "რიცხვების დამუშავება დასრულებულია"