# level 197:
# 1) მოცემულია სია numbers = [1, 2, 3, 4, 5, 12, 24, -1, -3, 44, 65, 43], lambdaს გამოყენებით დააბრუნე მხოლოდ ის რიცხვები რომლებიც მეტია 3-ზე.

# lambda-თი
numbers = [1, 2, 3, 4, 5, 12, 24, -1, -3, 44, 65, 43]

bigi= lambda list :  [ i for i in list  if i >3 ]   

print(bigi(numbers))

# filter-ით
bigi2=  list(filter(lambda num: num>3 ,numbers ))
print(bigi2)
# 2) მოცემუმლია სია numbers = [1, 2, 3, 4, 5, 6], lambdaს გამოყენებით ახალ სიაში ჩაამატე მხოლოდ ლუწი რიცხვები





# 3) მოცემულია words = ["hi", "hello", "world"], შექმენი lambda რომელიც აბრუნებს სტრინგების სიგრძეს
# 4) მოცემულია სია numbers = [2, 3, 4, 5, 7], lambdaს გამოყენებით სიის ყველა წევრი გაამრავლე საკუთარ ინდექსებზე და შემდეგ ჩაამატე ეს რიცხვები ახალ ცარიელ ლისტში
# 5) მოცემულია სია numbers = [12, 24, 55, 67, 98], შექმენი lambda, რომელიც აბრუნებს რიცხვის ციფრების ჯამს.
