/* 
# Level  74
1️⃣ ციფრების ჯამი
დაწერე კოდი, რომელიც for loop-ის გამოყენებით 1-დან 100-მდე ყველა ციფრის ჯამს გამოთვლის.

2️⃣ ლუწი და კენტი რიცხვები  
შექმენი for loop, რომელიც 1-დან 50-მდე რიცხვებს ამოწმებს და if-else-ის გამოყენებით ეკრანზე გამოაქვს:
   - "ლუწია", თუ რიცხვი ლუწია  
   - "კენტია", თუ კენტია  

3️⃣ ცხრილის გამრავლება  
დაწერე კოდი, რომელიც მომხმარებელს რიცხვს მოსთხოვს და for loop-ის საშუალებით ამ რიცხვის გამრავლების ცხრილს გამოიტანს (მაგალითად, თუ შეიყვანს 5-ს, უნდა აჩვენოს 5x1=5 ... 5x10=50).

4️⃣ ტემპერატურის კონვერტაცია  
შექმენი for loop, რომელიც Celsius-იდან Fahrenheit-ში გადაიყვანს ტემპერატურას 0-დან 100-მდე და if-else-ის გამოყენებით მიუთითებს, რომელი ტემპერატურა ცივია (<10°C), თბილია (10°C-30°C), ან ცხელია (>30°C).

5️⃣ სტრინგი დამუშავება  
დაწერე კოდი, რომელიც მოცემული სტრინგი (მაგალითად, `"JavaScript is awesome!"`) თითოეულ სიმბოლოს ამოწმებს და if-else-ის გამოყენებით გამოაქვს:
   - "მგონია, რომ ცარიელია", თუ სტრინგი ცარიელია  
   - "მსგავსი სიმბოლოა ნაპოვნი", თუ `"a"` სიმბოლო აღმოჩნდა სტრიქონში  
   - "სტანდარტული ტექსტი", თუ სხვა შემთხვევაში
*/

//task-1
let sum=0
for ( let x=0; x<100 ;x++){
   sum++
}

if (true || true){
   console.log(typeof(123123123123**1212))
   Number
}

console.log(sum)

//task-2
for (let i=1; i<50; i++){
   if (i%2==0){
      console.log( i+"luwia")
   }else{
      console.log(i+"kentia")
   }
}

//task-3
/*
 ?????
*/

