
"""შექმენით calculator ფუნქცია რომელსაც ექნება ყველა მათემატიკური მოქმედება მაგალითად:+,-,*,/. ფუნქციას გადაეცით 3 არგუმენტი. პირველი იქნება პირველი რიცხვი, მეორე მეორე რიცხვი და მესამე მათემატიკური ოპერაციის ოპერატორი (+,-...). და აგეთ კალკულატორი
დაიმახსოვრეთ რიცხვები მომხმარებელმა უნდა შეიტანოს, და პლიუს მომხმარებელმა უნდა გადასცეს რა მათემატიკური ოპერაცია გაკეთოს. (30 ქულიანი)"""
num1=int(input("num1 "))
num2=int(input("num2 "))
op=input("operation:")

def Main(num1 , num2 , op):

    if op =="+":
        return num1+num2
    elif op=="-":
        return num1-num2
    elif op=="*":    
        return num1*num2
    elif op=="/":
        return num1/num2
    
print(Main(num1,num2,op))
