"""მომხმარებელს შემოატანინე რიცხვი და თუ ეს რიცხვი არის ლუწი მაშინ დაიპრინტოს რომ ლუწია, თუ კენტია მაშინ კენტი.  (5 ქულა)

მომხმარებელს შემოატანინე რიცხვი და ეს რიცხვი თუ ემთხვევა შენ მიერ არჩეულ რიცხვს მაშინ ტაიპრინტოს True, სხვა შემთხვევაში False. (If/else გარეშე) (5 ქულა)

შექმენი ორი ცვლადი სადაც შეინახავთ რიცხვებს. შემდეგ კი ამ რიცხვებზე ჩაატარეთ ყველა მათემატიკური მოქმედება (5 ქულა)

შემოატანინე მომხმარებელს სახელი და გვარი შემდეგ კი დაპრინტე მათი კონკატენაცია (5 ქულა)
"""

def task1 ():
    anser=int(input("number:"))

    if anser%2==0:
        return print("ლუწია")
    else:
        return print("კენტი")

task1()

