/* 1) შექმენით 5 ელემენტიანი მასივი და splice გაუკეთეთ 1-დან 3 ელემენტამდე. ასევე slice-ში შეინახეთ 2-დან 3 ელემენტები. ამ ამოჭრილ slice-ში შენახულ ელემენტებში ჩაამატეთ splice-ით 2 ელემენტი

2) შექმენით 6 ელემენტიანი მასივი, წაშალეთ მასში შუა 2 ელემენტი splice-ით და ჩაამატეთ მათი ადგილას ახალი 3 ელემენტი. მიღებული მასივიდან slice-ით ამოჭერით ბოლო 2 ელემენტი.

3) შექმენით მასივი ['a', 'b', 'c', 'd', 'e'], splice-ით ამოიღეთ 'b', 'c' და შეინახეთ ცალკე ცვლადში. ამის შემდეგ ამ ცვლადში slice-ით ამოჭერით მხოლოდ 'c'. საბოლოოდ ამ ცვლადში ჩაამატეთ ორი ახალი სიმბოლო.

4) შექმენით რიცხვების მასივი 10-დან 60-მდე 10-ის ნამატებით. ამოაჭერით 20 და 30 და ჩაამატეთ მათი ადგილას 25 და 27. შემდეგ შექმენით ახალი მასივი slice-ით 40-დან ბოლომდე.

5) შექმენით 7 ელემენტიანი სტრინგების მასივი. splice-ით ამოაჭერით ელემენტები ინდექსებიდან 2-დან 4-მდე. მიღებული ამოჭრილი მასივი შეინახეთ და მასში slice-ით აიღეთ პირველი ორი ელემენტი და ჩაამატეთ მასში ახალი სტრინგი 'hello'.*/

let firstarr=['a', 'b', 'c', 'd', 'e']
function task1(arr){
        console.log(arr)
}

task1(firstarr)