"""
დავალება 1:
შექმენი class Car, რომელსაც ექნება brand, model, და year.
და ერთ-ერთი ფუნქცია ერქმევა car_info, რომელიც დაბეჭდავს მანქანის სრულ ინფორმაციას.

"""
class Car :    # შექნილია კლასიი Cars
    def __init__(self, brand, model, year):  # def __init__ არის  მეთოდი (ანუ ფუნქცია კლასსში) , რომელიც ხშირად გამოიყენებ და ატრიბუტების ინიციალიზაცია ანუ რაღაც ობიექტისთვის ატრიბუტების მინიჭება
        self.brand=brand # ეს სამივე არის ატრიბუტების მინიჭება
        self.model=model
        self.year=year

    def car_info(self):  # ეს არის ჩემს მიერ შექმნილი მეთოდი  გადაეცემა ობიექტების ყველა ატრიბუტ self-ით 
        print(self.brand, self.model, self.year) 

car=Car("###","!!!","@@@")  #ამ ცვლადს ცანიჭებთ ატრიბუტებს კლასსით

car.car_info() #აქ ვიძახებთ მეთოდს და არაფრის გადაცემა არ არის საჭირო რადგან უკვე მინიჭებული აქვს 

